RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/inc/at32f4xx_tim.h
/**
 **************************************************************************
 * File Name    : at32f4xx_tim.h
 * Description  : at32f4xx TIMER header file
 * Date         : 2018-10-08
 * Version      : V1.0.5
 **************************************************************************
 */


/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __AT32F4xx_TIM_H
#define __AT32F4xx_TIM_H

#ifdef __cplusplus
 extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "at32f4xx.h"

/** @addtogroup at32f4xx_StdPeriph_Driver
  * @{
  */

/** @addtogroup TMR
  * @{
  */

/** @defgroup TMR_Exported_Types
  * @{
  */

/**
  * @brief  TMR Time Base Init structure definition
  * @note   This structure is used with all TMRx except for TMR6 and TMR7.
  */

typedef struct
{
  uint16_t TMR_DIV;                     /*!< Specifies the prescaler value used to divide the TMR clock.
                                       This parameter can be a number between 0x0000 and 0xFFFF */

  uint32_t TMR_CounterMode;       /*!< Specifies the counter mode.
                                       This parameter can be a value of @ref TMR_Counter_Mode */

  uint32_t TMR_Period;            /*!< Specifies the period value to be loaded into the active
                                       Auto-Reload Register at the next update event.
                                                                             This parameter must be a number between 0x0000 and 0xFFFF. */

  uint16_t TMR_ClockDivision;     /*!< Specifies the clock division.
                                      This parameter can be a value of @ref TMR_Clock_Division_CKD */

  uint8_t TMR_RepetitionCounter;  /*!< Specifies the repetition counter value. Each time the RCR downcounter
                                       reaches zero, an update event is generated and counting restarts
                                       from the RCR value (N).
                                       This means in PWM mode that (N+1) corresponds to:
                                          - the number of PWM periods in edge-aligned mode
                                          - the number of half PWM period in center-aligned mode
                                       This parameter must be a number between 0x00 and 0xFF.
                                       @note This parameter is valid only for TMR1 and TMR8. */
} TMR_TimerBaseInitType;

/**
  * @brief  TMR Output Compare Init structure definition
  */

typedef struct
{
  uint16_t TMR_OCMode;        /*!< Specifies the TMR mode.
                                   This parameter can be a value of @ref TMR_Output_Compare_and_PWM_modes */

  uint16_t TMR_OutputState;   /*!< Specifies the TMR Output Compare state.
                                   This parameter can be a value of @ref TMR_Output_Compare_state */

  uint16_t TMR_OutputNState;  /*!< Specifies the TMR complementary Output Compare state.
                                   This parameter can be a value of @ref TMR_Output_Compare_N_state
                                   @note This parameter is valid only for TMR1 and TMR8. */

  uint32_t TMR_Pulse;         /*!< Specifies the pulse value to be loaded into the Capture Compare Register.
                                   This parameter can be a number between 0x0000 and 0xFFFF */


  uint16_t TMR_OCPolarity;    /*!< Specifies the output polarity.
                                   This parameter can be a value of @ref TMR_Output_Compare_Polarity */

  uint16_t TMR_OCNPolarity;   /*!< Specifies the complementary output polarity.
                                   This parameter can be a value of @ref TMR_Output_Compare_N_Polarity
                                   @note This parameter is valid only for TMR1 and TMR8. */

  uint16_t TMR_OCIdleState;   /*!< Specifies the TMR Output Compare pin state during Idle state.
                                   This parameter can be a value of @ref TMR_Output_Compare_Idle_State
                                   @note This parameter is valid only for TMR1 and TMR8. */

  uint16_t TMR_OCNIdleState;  /*!< Specifies the TMR Output Compare pin state during Idle state.
                                   This parameter can be a value of @ref TMR_Output_Compare_N_Idle_State
                                   @note This parameter is valid only for TMR1 and TMR8. */
} TMR_OCInitType;

/**
  * @brief  TMR Input Capture Init structure definition
  */

typedef struct
{

  uint16_t TMR_Channel;       /*!< Specifies the TMR channel.
                                  This parameter can be a value of @ref TMR_Channel */

  uint16_t TMR_ICPolarity;    /*!< Specifies the active edge of the input signal.
                                  This parameter can be a value of @ref TMR_Input_Capture_Polarity */

  uint16_t TMR_ICSelection;   /*!< Specifies the input.
                                  This parameter can be a value of @ref TMR_Input_Capture_Selection */

  uint16_t TMR_ICDIV;         /*!< Specifies the Input Capture Prescaler.
                                  This parameter can be a value of @ref TMR_Input_Capture_Prescaler */

  uint16_t TMR_ICFilter;      /*!< Specifies the input capture filter.
                                  This parameter can be a number between 0x0 and 0xF */
} TMR_ICInitType;

/**
  * @brief  BDTR structure definition
  * @note   This structure is used only with TMR1 and TMR8.
  */

typedef struct
{

  uint16_t TMR_OSIMRState;        /*!< Specifies the Off-State selection used in Run mode.
                                      This parameter can be a value of @ref OSSR_Off_State_Selection_for_Run_mode_state */

  uint16_t TMR_OSIMIState;        /*!< Specifies the Off-State used in Idle state.
                                      This parameter can be a value of @ref OSSI_Off_State_Selection_for_Idle_mode_state */

  uint16_t TMR_LOCKgrade;         /*!< Specifies the LOCK level parameters.
                                      This parameter can be a value of @ref Lock_level */

