RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/inc/at32f4xx_tim.h
  uint16_t TMR_DeadTime;          /*!< Specifies the delay time between the switching-off and the
                                      switching-on of the outputs.
                                      This parameter can be a number between 0x00 and 0xFF  */

  uint16_t TMR_Break;             /*!< Specifies whether the TMR Break input is enabled or not.
                                      This parameter can be a value of @ref Break_Input_enable_disable */

  uint16_t TMR_BreakPolarity;     /*!< Specifies the TMR Break Input pin polarity.
                                      This parameter can be a value of @ref Break_Polarity */

  uint16_t TMR_AutomaticOutput;   /*!< Specifies whether the TMR Automatic Output feature is enabled or not.
                                      This parameter can be a value of @ref TMR_AOE_Bit_Set_Reset */
} TMR_BRKDTInitType;

/** @defgroup TMR_Exported_constants
  * @{
  */

#if defined (AT32F403xx)
#define IS_TMR_ALL_PERIPH(PERIPH)    (((PERIPH) == TMR1) || \
                                      ((PERIPH) == TMR2) || \
                                      ((PERIPH) == TMR3) || \
                                      ((PERIPH) == TMR4) || \
                                      ((PERIPH) == TMR5) || \
                                      ((PERIPH) == TMR6) || \
                                      ((PERIPH) == TMR7) || \
                                      ((PERIPH) == TMR8) || \
                                      ((PERIPH) == TMR9) || \
                                      ((PERIPH) == TMR10)|| \
                                      ((PERIPH) == TMR11)|| \
                                      ((PERIPH) == TMR12)|| \
                                      ((PERIPH) == TMR13)|| \
                                      ((PERIPH) == TMR14)|| \
                                      ((PERIPH) == TMR15))
#elif defined (AT32F413xx)
#define IS_TMR_ALL_PERIPH(PERIPH)    (((PERIPH) == TMR1) || \
                                      ((PERIPH) == TMR2) || \
                                      ((PERIPH) == TMR3) || \
                                      ((PERIPH) == TMR4) || \
                                      ((PERIPH) == TMR5) || \
                                      ((PERIPH) == TMR8) || \
                                      ((PERIPH) == TMR9) || \
                                      ((PERIPH) == TMR10)|| \
                                      ((PERIPH) == TMR11))
#elif defined (AT32F415xx)
#define IS_TMR_ALL_PERIPH(PERIPH)    (((PERIPH) == TMR1) || \
                                      ((PERIPH) == TMR2) || \
                                      ((PERIPH) == TMR3) || \
                                      ((PERIPH) == TMR4) || \
                                      ((PERIPH) == TMR5) || \
                                      ((PERIPH) == TMR9) || \
                                      ((PERIPH) == TMR10)|| \
                                      ((PERIPH) == TMR11))
#elif defined (AT32F403Axx) || defined (AT32F407xx)
#define IS_TMR_ALL_PERIPH(PERIPH)    (((PERIPH) == TMR1) || \
                                      ((PERIPH) == TMR2) || \
                                      ((PERIPH) == TMR3) || \
                                      ((PERIPH) == TMR4) || \
                                      ((PERIPH) == TMR5) || \
                                      ((PERIPH) == TMR6) || \
                                      ((PERIPH) == TMR7) || \
                                      ((PERIPH) == TMR8) || \
                                      ((PERIPH) == TMR9) || \
                                      ((PERIPH) == TMR10)|| \
                                      ((PERIPH) == TMR11)|| \
                                      ((PERIPH) == TMR12)|| \
                                      ((PERIPH) == TMR13)|| \
                                      ((PERIPH) == TMR14))
#endif



/* LIST1: TMR 1, 8 and 15 */
#if defined (AT32F403xx)
#define IS_TMR_LIST1_PERIPH(PERIPH)  (((PERIPH) == TMR1) || \
                                      ((PERIPH) == TMR8) || \
                                      ((PERIPH) == TMR15))
#elif defined (AT32F413xx)
#define IS_TMR_LIST1_PERIPH(PERIPH)  (((PERIPH) == TMR1) || \
                                      ((PERIPH) == TMR8))
#elif defined (AT32F415xx)
#define IS_TMR_LIST1_PERIPH(PERIPH)  (((PERIPH) == TMR1))

#elif defined (AT32F403Axx) || defined (AT32F407xx)
#define IS_TMR_LIST1_PERIPH(PERIPH)  (((PERIPH) == TMR1) || \
                                      ((PERIPH) == TMR8))
#endif

/* LIST2: TMR 1, 8, 15 */
#if defined (AT32F403xx)
#define IS_TMR_LIST2_PERIPH(PERIPH)  (((PERIPH) == TMR1) || \
                                      ((PERIPH) == TMR8) || \
                                      ((PERIPH) == TMR15))
#elif defined (AT32F413xx)
#define IS_TMR_LIST2_PERIPH(PERIPH)  (((PERIPH) == TMR1) || \
                                      ((PERIPH) == TMR8))
#elif defined (AT32F415xx)
#define IS_TMR_LIST2_PERIPH(PERIPH)  (((PERIPH) == TMR1))

#elif defined (AT32F403Axx) || defined (AT32F407xx)
#define IS_TMR_LIST2_PERIPH(PERIPH)  (((PERIPH) == TMR1) || \
                                      ((PERIPH) == TMR8))
#endif


/* LIST3: TMR 1, 2, 3, 4, 5 ,8 and 15 */
#if defined (AT32F403xx)
#define IS_TMR_LIST3_PERIPH(PERIPH)  (((PERIPH) == TMR1) || \
                                      ((PERIPH) == TMR2) || \
                                      ((PERIPH) == TMR3) || \
                                      ((PERIPH) == TMR4) || \
                                      ((PERIPH) == TMR5) || \
                                      ((PERIPH) == TMR8) || \
                                      ((PERIPH) == TMR15))
#elif defined (AT32F413xx)
#define IS_TMR_LIST3_PERIPH(PERIPH)  (((PERIPH) == TMR1) || \
                                      ((PERIPH) == TMR2) || \
                                      ((PERIPH) == TMR3) || \
                                      ((PERIPH) == TMR4) || \
                                      ((PERIPH) == TMR5) || \
                                      ((PERIPH) == TMR8))
#elif defined (AT32F415xx)
#define IS_TMR_LIST3_PERIPH(PERIPH)  (((PERIPH) == TMR1) || \
                                      ((PERIPH) == TMR2) || \
                                      ((PERIPH) == TMR3) || \
                                      ((PERIPH) == TMR4) || \
                                      ((PERIPH) == TMR5))
#elif defined (AT32F403Axx) || defined (AT32F407xx)
#define IS_TMR_LIST3_PERIPH(PERIPH)  (((PERIPH) == TMR1) || \
                                      ((PERIPH) == TMR2) || \
                                      ((PERIPH) == TMR3) || \
                                      ((PERIPH) == TMR4) || \
                                      ((PERIPH) == TMR5) || \
                                      ((PERIPH) == TMR8))
#endif

/* LIST4: TMR 1, 2, 3, 4, 5, 8, 15 */
#if defined (AT32F403xx)
#define IS_TMR_LIST4_PERIPH(PERIPH)  (((PERIPH) == TMR1) || \
                                      ((PERIPH) == TMR2) || \
                                      ((PERIPH) == TMR3) || \
                                      ((PERIPH) == TMR4) || \
                                      ((PERIPH) == TMR5) || \
                                      ((PERIPH) == TMR8) || \
                                      ((PERIPH) == TMR15))
#elif defined (AT32F413xx)
#define IS_TMR_LIST4_PERIPH(PERIPH)  (((PERIPH) == TMR1) || \
                                      ((PERIPH) == TMR2) || \
                                      ((PERIPH) == TMR3) || \
                                      ((PERIPH) == TMR4) || \
                                      ((PERIPH) == TMR5) || \
                                      ((PERIPH) == TMR8))
#elif defined (AT32F415xx)
#define IS_TMR_LIST4_PERIPH(PERIPH)  (((PERIPH) == TMR1) || \
                                      ((PERIPH) == TMR2) || \
                                      ((PERIPH) == TMR3) || \
                                      ((PERIPH) == TMR4) || \
                                      ((PERIPH) == TMR5))
#elif defined (AT32F403Axx) || defined (AT32F407xx)
#define IS_TMR_LIST4_PERIPH(PERIPH)  (((PERIPH) == TMR1) || \
                                      ((PERIPH) == TMR2) || \
                                      ((PERIPH) == TMR3) || \
                                      ((PERIPH) == TMR4) || \
                                      ((PERIPH) == TMR5) || \
                                      ((PERIPH) == TMR8))
#endif

/* LIST5: TMR 1, 2, 3, 4, 5, 8 and 15 */

