RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/inc/at32f4xx_tim.h
#if defined (AT32F403xx)
#define IS_TMR_LIST5_PERIPH(PERIPH)  (((PERIPH) == TMR1) || \
                                      ((PERIPH) == TMR2) || \
                                      ((PERIPH) == TMR3) || \
                                      ((PERIPH) == TMR4) || \
                                      ((PERIPH) == TMR5) || \
                                      ((PERIPH) == TMR8) || \
                                      ((PERIPH) == TMR15))
#elif defined (AT32F413xx)
#define IS_TMR_LIST5_PERIPH(PERIPH)  (((PERIPH) == TMR1) || \
                                      ((PERIPH) == TMR2) || \
                                      ((PERIPH) == TMR3) || \
                                      ((PERIPH) == TMR4) || \
                                      ((PERIPH) == TMR5) || \
                                      ((PERIPH) == TMR8))
#elif defined (AT32F415xx)
#define IS_TMR_LIST5_PERIPH(PERIPH)  (((PERIPH) == TMR1) || \
                                      ((PERIPH) == TMR2) || \
                                      ((PERIPH) == TMR3) || \
                                      ((PERIPH) == TMR4) || \
                                      ((PERIPH) == TMR5))
#elif defined (AT32F403Axx) || defined (AT32F407xx)
#define IS_TMR_LIST5_PERIPH(PERIPH)  (((PERIPH) == TMR1) || \
                                      ((PERIPH) == TMR2) || \
                                      ((PERIPH) == TMR3) || \
                                      ((PERIPH) == TMR4) || \
                                      ((PERIPH) == TMR5) || \
                                      ((PERIPH) == TMR8))
#endif

/* LIST6: TMR 1, 2, 3, 4, 5, 8, 9, 12 and 15 */
#if defined (AT32F403xx)
#define IS_TMR_LIST6_PERIPH(PERIPH)  (((PERIPH) == TMR1) || \
                                      ((PERIPH) == TMR2) || \
                                      ((PERIPH) == TMR3) || \
                                      ((PERIPH) == TMR4) || \
                                      ((PERIPH) == TMR5) || \
                                      ((PERIPH) == TMR8) || \
                                      ((PERIPH) == TMR9) || \
                                      ((PERIPH) == TMR12)|| \
                                      ((PERIPH) == TMR15))
#elif defined (AT32F413xx)
#define IS_TMR_LIST6_PERIPH(PERIPH)  (((PERIPH) == TMR1) || \
                                      ((PERIPH) == TMR2) || \
                                      ((PERIPH) == TMR3) || \
                                      ((PERIPH) == TMR4) || \
                                      ((PERIPH) == TMR5) || \
                                      ((PERIPH) == TMR8) || \
                                      ((PERIPH) == TMR9))
#elif defined (AT32F415xx)
#define IS_TMR_LIST6_PERIPH(PERIPH)  (((PERIPH) == TMR1) || \
                                      ((PERIPH) == TMR2) || \
                                      ((PERIPH) == TMR3) || \
                                      ((PERIPH) == TMR4) || \
                                      ((PERIPH) == TMR5) || \
                                      ((PERIPH) == TMR9))
#elif defined (AT32F403Axx) || defined (AT32F407xx)
#define IS_TMR_LIST6_PERIPH(PERIPH)  (((PERIPH) == TMR1) || \
                                      ((PERIPH) == TMR2) || \
                                      ((PERIPH) == TMR3) || \
                                      ((PERIPH) == TMR4) || \
                                      ((PERIPH) == TMR5) || \
                                      ((PERIPH) == TMR8) || \
                                      ((PERIPH) == TMR9) || \
                                      ((PERIPH) == TMR12))
#endif

/* LIST7: TMR 1, 2, 3, 4, 5, 6, 7, 8, 9, 12 and 15 */
#if defined (AT32F403xx)
#define IS_TMR_LIST7_PERIPH(PERIPH)  (((PERIPH) == TMR1) || \
                                      ((PERIPH) == TMR2) || \
                                      ((PERIPH) == TMR3) || \
                                      ((PERIPH) == TMR4) || \
                                      ((PERIPH) == TMR5) || \
                                      ((PERIPH) == TMR6) || \
                                      ((PERIPH) == TMR7) || \
                                      ((PERIPH) == TMR8) || \
                                      ((PERIPH) == TMR9) || \
                                      ((PERIPH) == TMR12)|| \
                                      ((PERIPH) == TMR15))
#elif defined (AT32F413xx)
#define IS_TMR_LIST7_PERIPH(PERIPH)  (((PERIPH) == TMR1) || \
                                      ((PERIPH) == TMR2) || \
                                      ((PERIPH) == TMR3) || \
                                      ((PERIPH) == TMR4) || \
                                      ((PERIPH) == TMR5) || \
                                      ((PERIPH) == TMR8) || \
                                      ((PERIPH) == TMR9))
#elif defined (AT32F415xx)
#define IS_TMR_LIST7_PERIPH(PERIPH)  (((PERIPH) == TMR1) || \
                                      ((PERIPH) == TMR2) || \
                                      ((PERIPH) == TMR3) || \
                                      ((PERIPH) == TMR4) || \
                                      ((PERIPH) == TMR5) || \
                                      ((PERIPH) == TMR9))
#elif defined (AT32F403Axx) || defined (AT32F407xx)
#define IS_TMR_LIST7_PERIPH(PERIPH)  (((PERIPH) == TMR1) || \
                                      ((PERIPH) == TMR2) || \
                                      ((PERIPH) == TMR3) || \
                                      ((PERIPH) == TMR4) || \
                                      ((PERIPH) == TMR5) || \
                                      ((PERIPH) == TMR6) || \
                                      ((PERIPH) == TMR7) || \
                                      ((PERIPH) == TMR8) || \
                                      ((PERIPH) == TMR9) || \
                                      ((PERIPH) == TMR12))
#endif

/* LIST8: TMR 1, 2, 3, 4, 5, 8, 9, 10, 11, 12, 13, 14, 15 */
#if defined (AT32F403xx)
#define IS_TMR_LIST8_PERIPH(PERIPH)  (((PERIPH) == TMR1) || \
                                      ((PERIPH) == TMR2) || \
                                      ((PERIPH) == TMR3) || \
                                      ((PERIPH) == TMR4) || \
                                      ((PERIPH) == TMR5) || \
                                      ((PERIPH) == TMR8) || \
                                      ((PERIPH) == TMR9) || \
                                      ((PERIPH) == TMR10)|| \
                                      ((PERIPH) == TMR11)|| \
                                      ((PERIPH) == TMR12)|| \
                                      ((PERIPH) == TMR13)|| \
                                      ((PERIPH) == TMR14)|| \
                                      ((PERIPH) == TMR15))
#elif defined (AT32F413xx)
#define IS_TMR_LIST8_PERIPH(PERIPH)  (((PERIPH) == TMR1) || \
                                      ((PERIPH) == TMR2) || \
                                      ((PERIPH) == TMR3) || \
                                      ((PERIPH) == TMR4) || \
                                      ((PERIPH) == TMR5) || \
                                      ((PERIPH) == TMR8) || \
                                      ((PERIPH) == TMR9) || \
                                      ((PERIPH) == TMR10)|| \
                                      ((PERIPH) == TMR11))
#elif defined (AT32F415xx)
#define IS_TMR_LIST8_PERIPH(PERIPH)  (((PERIPH) == TMR1) || \
                                      ((PERIPH) == TMR2) || \
                                      ((PERIPH) == TMR3) || \
                                      ((PERIPH) == TMR4) || \
                                      ((PERIPH) == TMR5) || \
                                      ((PERIPH) == TMR9) || \
                                      ((PERIPH) == TMR10)|| \
                                      ((PERIPH) == TMR11))
#elif defined (AT32F403Axx) || defined (AT32F407xx)
#define IS_TMR_LIST8_PERIPH(PERIPH)  (((PERIPH) == TMR1) || \
                                      ((PERIPH) == TMR2) || \
                                      ((PERIPH) == TMR3) || \
                                      ((PERIPH) == TMR4) || \
                                      ((PERIPH) == TMR5) || \
                                      ((PERIPH) == TMR8) || \
                                      ((PERIPH) == TMR9) || \
                                      ((PERIPH) == TMR10)|| \
                                      ((PERIPH) == TMR11)|| \
                                      ((PERIPH) == TMR12)|| \
                                      ((PERIPH) == TMR13)|| \
                                      ((PERIPH) == TMR14))
#endif

