RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/inc/at32f4xx_tim.h
/* LIST9: TMR 1, 2, 3, 4, 5, 6, 7, 8, 15 */
#if defined (AT32F403xx)
#define IS_TMR_LIST9_PERIPH(PERIPH)  (((PERIPH) == TMR1) || \
                                      ((PERIPH) == TMR2) || \
                                      ((PERIPH) == TMR3) || \
                                      ((PERIPH) == TMR4) || \
                                      ((PERIPH) == TMR5) || \
                                      ((PERIPH) == TMR6) || \
                                      ((PERIPH) == TMR7) || \
                                      ((PERIPH) == TMR8) || \
                                      ((PERIPH) == TMR15))
#elif defined (AT32F413xx)
#define IS_TMR_LIST9_PERIPH(PERIPH)  (((PERIPH) == TMR1) || \
                                      ((PERIPH) == TMR2) || \
                                      ((PERIPH) == TMR3) || \
                                      ((PERIPH) == TMR4) || \
                                      ((PERIPH) == TMR5) || \
                                      ((PERIPH) == TMR8))
#elif defined (AT32F415xx)
#define IS_TMR_LIST9_PERIPH(PERIPH)  (((PERIPH) == TMR1) || \
                                      ((PERIPH) == TMR2) || \
                                      ((PERIPH) == TMR3) || \
                                      ((PERIPH) == TMR4) || \
                                      ((PERIPH) == TMR5))
#elif defined (AT32F403Axx) || defined (AT32F407xx)
#define IS_TMR_LIST9_PERIPH(PERIPH)  (((PERIPH) == TMR1) || \
                                      ((PERIPH) == TMR2) || \
                                      ((PERIPH) == TMR3) || \
                                      ((PERIPH) == TMR4) || \
                                      ((PERIPH) == TMR5) || \
                                      ((PERIPH) == TMR6) || \
                                      ((PERIPH) == TMR7) || \
                                      ((PERIPH) == TMR8))
#endif

/*LIST10:TIM 2, 5*/
#define IS_TMR_PLUSMODE_PERIPH(PERIPH) (((PERIPH)==TMR2) ||\
                                                                             ((PERIPH)==TMR5))
/**
  * @}
  */

/** @defgroup TMR_Output_Compare_and_PWM_modes
  * @{
  */

#define TMR_OCMode_Timing                  ((uint16_t)0x0000)
#define TMR_OCMode_Active                  ((uint16_t)0x0010)
#define TMR_OCMode_Inactive                ((uint16_t)0x0020)
#define TMR_OCMode_Toggle                  ((uint16_t)0x0030)
#define TMR_OCMode_PWM1                    ((uint16_t)0x0060)
#define TMR_OCMode_PWM2                    ((uint16_t)0x0070)
#define IS_TMR_OC_MODE(MODE)               (((MODE) == TMR_OCMode_Timing) || \
                                            ((MODE) == TMR_OCMode_Active) || \
                                            ((MODE) == TMR_OCMode_Inactive) || \
                                            ((MODE) == TMR_OCMode_Toggle)|| \
                                            ((MODE) == TMR_OCMode_PWM1) || \
                                            ((MODE) == TMR_OCMode_PWM2))
#define IS_TMR_OCM(MODE)                   (((MODE) == TMR_OCMode_Timing) || \
                                            ((MODE) == TMR_OCMode_Active) || \
                                            ((MODE) == TMR_OCMode_Inactive) || \
                                            ((MODE) == TMR_OCMode_Toggle)|| \
                                            ((MODE) == TMR_OCMode_PWM1) || \
                                            ((MODE) == TMR_OCMode_PWM2) ||    \
                                            ((MODE) == TMR_ForcedAction_Active) || \
                                            ((MODE) == TMR_ForcedAction_InActive))
/**
  * @}
  */

/** @defgroup TMR_One_Pulse_Mode
  * @{
  */

#define TMR_OPMode_Once                  ((uint16_t)0x0008)
#define TMR_OPMode_Repetitive            ((uint16_t)0x0000)
#define IS_TMR_OPM_MODE(MODE)            (((MODE) == TMR_OPMode_Once) || \
                                          ((MODE) == TMR_OPMode_Repetitive))
/**
  * @}
  */

/** @defgroup TMR_Channel
  * @{
  */

#define TMR_Channel_1                      ((uint16_t)0x0000)
#define TMR_Channel_2                      ((uint16_t)0x0004)
#define TMR_Channel_3                      ((uint16_t)0x0008)
#define TMR_Channel_4                      ((uint16_t)0x000C)
#define IS_TMR_CHANNEL(CHANNEL)            (((CHANNEL) == TMR_Channel_1) || \
                                            ((CHANNEL) == TMR_Channel_2) || \
                                            ((CHANNEL) == TMR_Channel_3) || \
                                            ((CHANNEL) == TMR_Channel_4))
#define IS_TMR_PWMI_CHANNEL(CHANNEL)       (((CHANNEL) == TMR_Channel_1) || \
                                            ((CHANNEL) == TMR_Channel_2))
#define IS_TMR_COMPLEMENTARY_CHANNEL(CHANNEL) (((CHANNEL) == TMR_Channel_1) || \
                                               ((CHANNEL) == TMR_Channel_2) || \
                                               ((CHANNEL) == TMR_Channel_3))
/**
  * @}
  */

/** @defgroup TMR_Clock_Division_CKD
  * @{
  */

#define TMR_CKD_DIV1                       ((uint16_t)0x0000)
#define TMR_CKD_DIV2                       ((uint16_t)0x0100)
#define TMR_CKD_DIV4                       ((uint16_t)0x0200)
#define IS_TMR_CKD_DIV(DIV)                (((DIV) == TMR_CKD_DIV1) || \
                                            ((DIV) == TMR_CKD_DIV2) || \
                                            ((DIV) == TMR_CKD_DIV4))
/**
  * @}
  */


/** @defgroup TMR_Counter_Mode
  * @{
  */

#define TMR_CounterDIR_Up                 ((uint16_t)0x0000)
#define TMR_CounterDIR_Down               ((uint16_t)0x0010)
#define TMR_CounterDIR_CenterAligned1     ((uint16_t)0x0020)
#define TMR_CounterDIR_CenterAligned2     ((uint16_t)0x0040)
#define TMR_CounterDIR_CenterAligned3     ((uint16_t)0x0060)
#define IS_TMR_COUNTER_DIR(DIR)           (((DIR) == TMR_CounterDIR_Up) ||  \
                                           ((DIR) == TMR_CounterDIR_Down) || \
                                           ((DIR) == TMR_CounterDIR_CenterAligned1) || \
                                           ((DIR) == TMR_CounterDIR_CenterAligned2) || \
                                           ((DIR) == TMR_CounterDIR_CenterAligned3))
/**
  * @}
  */

/** @defgroup TMR_Output_Compare_Polarity
  * @{
  */

#define TMR_OCPolarity_High                ((uint16_t)0x0000)
#define TMR_OCPolarity_Low                 ((uint16_t)0x0002)
#define IS_TMR_OC_POLARITY(POLARITY)       (((POLARITY) == TMR_OCPolarity_High) || \
                                            ((POLARITY) == TMR_OCPolarity_Low))
/**
  * @}
  */

/** @defgroup TMR_Output_Compare_N_Polarity
  * @{
  */

#define TMR_OCNPolarity_High               ((uint16_t)0x0000)
#define TMR_OCNPolarity_Low                ((uint16_t)0x0008)
#define IS_TMR_OCN_POLARITY(POLARITY)      (((POLARITY) == TMR_OCNPolarity_High) || \
                                            ((POLARITY) == TMR_OCNPolarity_Low))
/**
  * @}
  */

/** @defgroup TMR_Output_Compare_state
  * @{
  */

