RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/inc/at32f4xx_tim.h
/** @defgroup TMR_DMA_sources
  * @{
  */

#define TMR_DMA_Update                      ((uint16_t)0x0100)
#define TMR_DMA_CC1                         ((uint16_t)0x0200)
#define TMR_DMA_CC2                         ((uint16_t)0x0400)
#define TMR_DMA_CC3                         ((uint16_t)0x0800)
#define TMR_DMA_CC4                         ((uint16_t)0x1000)
#define TMR_DMA_HALL                        ((uint16_t)0x2000)
#define TMR_DMA_Trigger                     ((uint16_t)0x4000)
#define IS_TMR_DMA_SOURCE(SOURCE)           ((((SOURCE) & (uint16_t)0x80FF) == 0x0000) && ((SOURCE) != 0x0000))

/**
  * @}
  */

/** @defgroup TMR_External_Trigger_Prescaler
  * @{
  */

#define TMR_ExtTRGDIV_OFF                  ((uint16_t)0x0000)
#define TMR_ExtTRGDIV_DIV2                 ((uint16_t)0x1000)
#define TMR_ExtTRGDIV_DIV4                 ((uint16_t)0x2000)
#define TMR_ExtTRGDIV_DIV8                 ((uint16_t)0x3000)
#define IS_TMR_EXT_DIV(DIV)                (((DIV) == TMR_ExtTRGDIV_OFF) || \
                                            ((DIV) == TMR_ExtTRGDIV_DIV2) || \
                                            ((DIV) == TMR_ExtTRGDIV_DIV4) || \
                                            ((DIV) == TMR_ExtTRGDIV_DIV8))
/**
  * @}
  */

/** @defgroup TMR_Internal_Trigger_Selection
  * @{
  */

#define TMR_TRGSEL_ITR0                        ((uint16_t)0x0000)
#define TMR_TRGSEL_ITR1                        ((uint16_t)0x0010)
#define TMR_TRGSEL_ITR2                        ((uint16_t)0x0020)
#define TMR_TRGSEL_ITR3                        ((uint16_t)0x0030)
#define TMR_TRGSEL_TI1F_ED                     ((uint16_t)0x0040)
#define TMR_TRGSEL_TI1FP1                      ((uint16_t)0x0050)
#define TMR_TRGSEL_TI2FP2                      ((uint16_t)0x0060)
#define TMR_TRGSEL_ETRF                        ((uint16_t)0x0070)
#define IS_TMR_TRIGGER_SELECTION(SELECTION)    (((SELECTION) == TMR_TRGSEL_ITR0) || \
                                                ((SELECTION) == TMR_TRGSEL_ITR1) || \
                                                ((SELECTION) == TMR_TRGSEL_ITR2) || \
                                                ((SELECTION) == TMR_TRGSEL_ITR3) || \
                                                ((SELECTION) == TMR_TRGSEL_TI1F_ED) || \
                                                ((SELECTION) == TMR_TRGSEL_TI1FP1) || \
                                                ((SELECTION) == TMR_TRGSEL_TI2FP2) || \
                                                ((SELECTION) == TMR_TRGSEL_ETRF))
#define IS_TMR_INTERNAL_TRIGGER_SELECTION(SELECTION) (((SELECTION) == TMR_TRGSEL_ITR0) || \
                                                      ((SELECTION) == TMR_TRGSEL_ITR1) || \
                                                      ((SELECTION) == TMR_TRGSEL_ITR2) || \
                                                      ((SELECTION) == TMR_TRGSEL_ITR3))
/**
  * @}
  */

/** @defgroup TMR_TIx_External_Clock_Source
  * @{
  */

#define TMR_TIxExternalCLK1Source_TI1         ((uint16_t)0x0050)
#define TMR_TIxExternalCLK1Source_TI2         ((uint16_t)0x0060)
#define TMR_TIxExternalCLK1Source_TI1ED       ((uint16_t)0x0040)
#define IS_TMR_TIXCLK_SOURCE(SOURCE)          (((SOURCE) == TMR_TIxExternalCLK1Source_TI1) || \
                                               ((SOURCE) == TMR_TIxExternalCLK1Source_TI2) || \
                                               ((SOURCE) == TMR_TIxExternalCLK1Source_TI1ED))
/**
  * @}
  */

/** @defgroup TMR_External_Trigger_Polarity
  * @{
  */
#define TMR_ExtTRGPolarity_Inverted         ((uint16_t)0x8000)
#define TMR_ExtTRGPolarity_NonInverted      ((uint16_t)0x0000)
#define IS_TMR_EXT_POLARITY(POLARITY)       (((POLARITY) == TMR_ExtTRGPolarity_Inverted) || \
                                             ((POLARITY) == TMR_ExtTRGPolarity_NonInverted))
/**
  * @}
  */

/** @defgroup TMR_Prescaler_Reload_Mode
  * @{
  */

#define TMR_DIVReloadMode_Update           ((uint16_t)0x0000)
#define TMR_DIVReloadMode_Immediate        ((uint16_t)0x0001)
#define IS_TMR_DIV_RELOAD(RELOAD)          (((RELOAD) == TMR_DIVReloadMode_Update) || \
                                            ((RELOAD) == TMR_DIVReloadMode_Immediate))
/**
  * @}
  */

/** @defgroup TMR_Forced_Action
  * @{
  */

#define TMR_ForcedAction_Active            ((uint16_t)0x0050)
#define TMR_ForcedAction_InActive          ((uint16_t)0x0040)
#define IS_TMR_FORCED_ACTION(ACTION)       (((ACTION) == TMR_ForcedAction_Active) || \
                                            ((ACTION) == TMR_ForcedAction_InActive))
/**
  * @}
  */

/** @defgroup TMR_Encoder_Mode
  * @{
  */

#define TMR_EncoderMode_TI1                ((uint16_t)0x0001)
#define TMR_EncoderMode_TI2                ((uint16_t)0x0002)
#define TMR_EncoderMode_TI12               ((uint16_t)0x0003)
#define IS_TMR_ENCODER_MODE(MODE)          (((MODE) == TMR_EncoderMode_TI1) || \
                                            ((MODE) == TMR_EncoderMode_TI2) || \
                                            ((MODE) == TMR_EncoderMode_TI12))
/**
  * @}
  */


/** @defgroup TMR_Event_Source
  * @{
  */

#define TMR_EventSource_Update             ((uint16_t)0x0001)
#define TMR_EventSource_CC1                ((uint16_t)0x0002)
#define TMR_EventSource_CC2                ((uint16_t)0x0004)
#define TMR_EventSource_CC3                ((uint16_t)0x0008)
#define TMR_EventSource_CC4                ((uint16_t)0x0010)
#define TMR_EventSource_HALL               ((uint16_t)0x0020)
#define TMR_EventSource_Trigger            ((uint16_t)0x0040)
#define TMR_EventSource_Break              ((uint16_t)0x0080)
#define IS_TMR_EVENT_SOURCE(SOURCE)        ((((SOURCE) & (uint16_t)0xFF00) == 0x0000) && ((SOURCE) != 0x0000))

/**
  * @}
  */

/** @defgroup TMR_Update_Source
  * @{
  */

#define TMR_UpdateSource_Global            ((uint16_t)0x0000) /*!< Source of update is the counter overflow/underflow
                                                                   or the setting of UG bit, or an update generation
                                                                   through the slave mode controller. */
#define TMR_UpdateSource_Regular           ((uint16_t)0x0001) /*!< Source of update is counter overflow/underflow. */
#define IS_TMR_UPDATE_SOURCE(SOURCE)       (((SOURCE) == TMR_UpdateSource_Global) || \
                                            ((SOURCE) == TMR_UpdateSource_Regular))
/**
  * @}
  */

