RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/inc/at32f4xx_tim.h
/** @defgroup TIM_Plus_Mode__State
  * @{
  */

#define TMR_Plus_Mode_Enable              ((uint16_t)0x0400)
#define TMR_Plus_Mode_Disable             ((uint16_t)0x0000)
#define IS_TMR_PLUS_MODE_STATE(STATE) (((STATE) == TMR_Plus_Mode_Enable) || \
                                       ((STATE) == TMR_Plus_Mode_Disable))
/**
  * @}
  */

/** @defgroup TMR_Output_Compare_Preload_State
  * @{
  */

#define TMR_OCPreload_Enable               ((uint16_t)0x0008)
#define TMR_OCPreload_Disable              ((uint16_t)0x0000)
#define IS_TMR_OCPRELOAD_STATE(STATE)      (((STATE) == TMR_OCPreload_Enable) || \
                                            ((STATE) == TMR_OCPreload_Disable))
/**
  * @}
  */

/** @defgroup TMR_Output_Compare_Fast_State
  * @{
  */

#define TMR_OCFast_Enable                  ((uint16_t)0x0004)
#define TMR_OCFast_Disable                 ((uint16_t)0x0000)
#define IS_TMR_OCFAST_STATE(STATE)         (((STATE) == TMR_OCFast_Enable) || \
                                            ((STATE) == TMR_OCFast_Disable))

/**
  * @}
  */

/** @defgroup TMR_Output_Compare_Clear_State
  * @{
  */

#define TMR_OCClear_Enable                 ((uint16_t)0x0080)
#define TMR_OCClear_Disable                ((uint16_t)0x0000)
#define IS_TMR_OCCLEAR_STATE(STATE)        (((STATE) == TMR_OCClear_Enable) || \
                                            ((STATE) == TMR_OCClear_Disable))
/**
  * @}
  */

/** @defgroup TMR_Trigger_Output_Source
  * @{
  */

#define TMR_TRGOSource_Reset               ((uint16_t)0x0000)
#define TMR_TRGOSource_Enable              ((uint16_t)0x0010)
#define TMR_TRGOSource_Update              ((uint16_t)0x0020)
#define TMR_TRGOSource_OC1                 ((uint16_t)0x0030)
#define TMR_TRGOSource_OC1Ref              ((uint16_t)0x0040)
#define TMR_TRGOSource_OC2Ref              ((uint16_t)0x0050)
#define TMR_TRGOSource_OC3Ref              ((uint16_t)0x0060)
#define TMR_TRGOSource_OC4Ref              ((uint16_t)0x0070)
#define IS_TMR_TRGO_SOURCE(SOURCE)         (((SOURCE) == TMR_TRGOSource_Reset) || \
                                            ((SOURCE) == TMR_TRGOSource_Enable) || \
                                            ((SOURCE) == TMR_TRGOSource_Update) || \
                                            ((SOURCE) == TMR_TRGOSource_OC1) || \
                                            ((SOURCE) == TMR_TRGOSource_OC1Ref) || \
                                            ((SOURCE) == TMR_TRGOSource_OC2Ref) || \
                                            ((SOURCE) == TMR_TRGOSource_OC3Ref) || \
                                            ((SOURCE) == TMR_TRGOSource_OC4Ref))
/**
  * @}
  */

/** @defgroup TMR_Slave_Mode
  * @{
  */

#define TMR_SlaveMode_Reset                ((uint16_t)0x0004)
#define TMR_SlaveMode_Gate                 ((uint16_t)0x0005)
#define TMR_SlaveMode_Trigger              ((uint16_t)0x0006)
#define TMR_SlaveMode_External1            ((uint16_t)0x0007)
#define IS_TMR_SLAVE_MODE(MODE)            (((MODE) == TMR_SlaveMode_Reset) || \
                                            ((MODE) == TMR_SlaveMode_Gate) || \
                                            ((MODE) == TMR_SlaveMode_Trigger) || \
                                            ((MODE) == TMR_SlaveMode_External1))
/**
  * @}
  */

/** @defgroup TMR_Master_Slave_Mode
  * @{
  */

#define TMR_MasterSlaveMode_Enable         ((uint16_t)0x0080)
#define TMR_MasterSlaveMode_Disable        ((uint16_t)0x0000)
#define IS_TMR_MSMODE_STATE(STATE)         (((STATE) == TMR_MasterSlaveMode_Enable) || \
                                            ((STATE) == TMR_MasterSlaveMode_Disable))
/**
  * @}
  */

/** @defgroup TMR_Flags
  * @{
  */

#define TMR_FLAG_Update                    ((uint16_t)0x0001)
#define TMR_FLAG_CC1                       ((uint16_t)0x0002)
#define TMR_FLAG_CC2                       ((uint16_t)0x0004)
#define TMR_FLAG_CC3                       ((uint16_t)0x0008)
#define TMR_FLAG_CC4                       ((uint16_t)0x0010)
#define TMR_FLAG_HALL                      ((uint16_t)0x0020)
#define TMR_FLAG_Trigger                   ((uint16_t)0x0040)
#define TMR_FLAG_Break                     ((uint16_t)0x0080)
#define TMR_FLAG_C1OF                      ((uint16_t)0x0200)
#define TMR_FLAG_C2OF                      ((uint16_t)0x0400)
#define TMR_FLAG_C3OF                      ((uint16_t)0x0800)
#define TMR_FLAG_C4OF                      ((uint16_t)0x1000)
#define IS_TMR_GET_FLAG(FLAG)              (((FLAG) == TMR_FLAG_Update) || \
                                            ((FLAG) == TMR_FLAG_CC1) || \
                                            ((FLAG) == TMR_FLAG_CC2) || \
                                            ((FLAG) == TMR_FLAG_CC3) || \
                                            ((FLAG) == TMR_FLAG_CC4) || \
                                            ((FLAG) == TMR_FLAG_HALL) || \
                                            ((FLAG) == TMR_FLAG_Trigger) || \
                                            ((FLAG) == TMR_FLAG_Break) || \
                                            ((FLAG) == TMR_FLAG_C1OF) || \
                                            ((FLAG) == TMR_FLAG_C2OF) || \
                                            ((FLAG) == TMR_FLAG_C3OF) || \
                                            ((FLAG) == TMR_FLAG_C4OF))


#define IS_TMR_CLEAR_FLAG(TMR_FLAG)        ((((TMR_FLAG) & (uint16_t)0xE100) == 0x0000) && ((TMR_FLAG) != 0x0000))
/**
  * @}
  */

/** @defgroup TMR_Input_Capture_Filer_Value
  * @{
  */

#define IS_TMR_IC_FILTER(ICFILTER)         ((ICFILTER) <= 0xF)
/**
  * @}
  */

/** @defgroup TMR_External_Trigger_Filter
  * @{
  */

#define IS_TMR_EXT_FILTER(EXTFILTER)      ((EXTFILTER) <= 0xF)
/**
  * @}
  */

/** @defgroup TMR_Legacy
  * @{
  */

#define TMR_DMABurstLength_1Byte           TMR_DMABurstLength_1Transfer
#define TMR_DMABurstLength_2Bytes          TMR_DMABurstLength_2Transfers
#define TMR_DMABurstLength_3Bytes          TMR_DMABurstLength_3Transfers
#define TMR_DMABurstLength_4Bytes          TMR_DMABurstLength_4Transfers
#define TMR_DMABurstLength_5Bytes          TMR_DMABurstLength_5Transfers
#define TMR_DMABurstLength_6Bytes          TMR_DMABurstLength_6Transfers
#define TMR_DMABurstLength_7Bytes          TMR_DMABurstLength_7Transfers
#define TMR_DMABurstLength_8Bytes          TMR_DMABurstLength_8Transfers
#define TMR_DMABurstLength_9Bytes          TMR_DMABurstLength_9Transfers
#define TMR_DMABurstLength_10Bytes         TMR_DMABurstLength_10Transfers
#define TMR_DMABurstLength_11Bytes         TMR_DMABurstLength_11Transfers
#define TMR_DMABurstLength_12Bytes         TMR_DMABurstLength_12Transfers
#define TMR_DMABurstLength_13Bytes         TMR_DMABurstLength_13Transfers
#define TMR_DMABurstLength_14Bytes         TMR_DMABurstLength_14Transfers
#define TMR_DMABurstLength_15Bytes         TMR_DMABurstLength_15Transfers
#define TMR_DMABurstLength_16Bytes         TMR_DMABurstLength_16Transfers
#define TMR_DMABurstLength_17Bytes         TMR_DMABurstLength_17Transfers
#define TMR_DMABurstLength_18Bytes         TMR_DMABurstLength_18Transfers
/**
  * @}
  */

/**
  * @}
  */

/** @defgroup TMR_Exported_Macros
  * @{
  */

/**
  * @}
  */

/** @defgroup TMR_Exported_Functions
  * @{
  */

void TMR_Reset(TMR_Type* TMRx);
void TMR_TimeBaseInit(TMR_Type* TMRx, TMR_TimerBaseInitType* TMR_TimeBaseInitStruct);
void TMR_OC1Init(TMR_Type* TMRx, TMR_OCInitType* TMR_OCInitStruct);
void TMR_OC2Init(TMR_Type* TMRx, TMR_OCInitType* TMR_OCInitStruct);
void TMR_OC3Init(TMR_Type* TMRx, TMR_OCInitType* TMR_OCInitStruct);
void TMR_OC4Init(TMR_Type* TMRx, TMR_OCInitType* TMR_OCInitStruct);
void TMR_ICInit(TMR_Type* TMRx, TMR_ICInitType* TMR_ICInitStruct);
void TMR_PWMIConfig(TMR_Type* TMRx, TMR_ICInitType* TMR_ICInitStruct);
void TMR_BRKDTConfig(TMR_Type* TMRx, TMR_BRKDTInitType *TMR_BDTRInitStruct);
void TMR_TimeBaseStructInit(TMR_TimerBaseInitType* TMR_TimeBaseInitStruct);
void TMR_OCStructInit(TMR_OCInitType* TMR_OCInitStruct);
void TMR_ICStructInit(TMR_ICInitType* TMR_ICInitStruct);
void TMR_BRKDTStructInit(TMR_BRKDTInitType* TMR_BDTRInitStruct);
void TMR_Cmd(TMR_Type* TMRx, FunctionalState NewState);
void TMR_CtrlPWMOutputs(TMR_Type* TMRx, FunctionalState NewState);
void TMR_INTConfig(TMR_Type* TMRx, uint16_t TMR_INT, FunctionalState NewState);
void TMR_GenerateEvent(TMR_Type* TMRx, uint16_t TMR_EventSource);
void TMR_DMAConfig(TMR_Type* TMRx, uint16_t TMR_DMABase, uint16_t TMR_DMABurstLength);
void TMR_DMACmd(TMR_Type* TMRx, uint16_t TMR_DMASource, FunctionalState NewState);
void TMR_InternalClockConfig(TMR_Type* TMRx);
void TMR_ITRxExternalClockConfig(TMR_Type* TMRx, uint16_t TMR_InputTriggerSource);
void TMR_TIxExternalClockConfig(TMR_Type* TMRx, uint16_t TMR_TIxExternalCLKSource,
                                uint16_t TMR_ICPolarity, uint16_t ICFilter);
void TMR_ETRClockMode1Config(TMR_Type* TMRx, uint16_t TMR_ExtTRGPrescaler, uint16_t TMR_ExtTRGPolarity,
                             uint16_t ExtTRGFilter);
void TMR_ETRClockMode2Config(TMR_Type* TMRx, uint16_t TMR_ExtTRGPrescaler,
                             uint16_t TMR_ExtTRGPolarity, uint16_t ExtTRGFilter);
void TMR_ETRConfig(TMR_Type* TMRx, uint16_t TMR_ExtTRGPrescaler, uint16_t TMR_ExtTRGPolarity,
                   uint16_t ExtTRGFilter);
void TMR_DIVConfig(TMR_Type* TMRx, uint16_t Prescaler, uint16_t TMR_PSCReloadMode);
void TMR_CounterModeConfig(TMR_Type* TMRx, uint16_t TMR_CounterMode);
void TMR_SelectInputTrigger(TMR_Type* TMRx, uint16_t TMR_InputTriggerSource);
void TMR_EncoderInterfaceConfig(TMR_Type* TMRx, uint16_t TMR_EncoderMode,
                                uint16_t TMR_IC1Polarity, uint16_t TMR_IC2Polarity);
void TMR_ForcedOC1Config(TMR_Type* TMRx, uint16_t TMR_ForcedAction);
void TMR_ForcedOC2Config(TMR_Type* TMRx, uint16_t TMR_ForcedAction);
void TMR_ForcedOC3Config(TMR_Type* TMRx, uint16_t TMR_ForcedAction);
void TMR_ForcedOC4Config(TMR_Type* TMRx, uint16_t TMR_ForcedAction);
void TMR_ARPreloadConfig(TMR_Type* TMRx, FunctionalState NewState);
void TMR_SelectHALL(TMR_Type* TMRx, FunctionalState NewState);
void TMR_SelectCCDMA(TMR_Type* TMRx, FunctionalState NewState);
void TMR_CCPreloadControl(TMR_Type* TMRx, FunctionalState NewState);
void TMR_OC1PreloadConfig(TMR_Type* TMRx, uint16_t TMR_OCPreload);
void TMR_OC2PreloadConfig(TMR_Type* TMRx, uint16_t TMR_OCPreload);
void TMR_OC3PreloadConfig(TMR_Type* TMRx, uint16_t TMR_OCPreload);
void TMR_OC4PreloadConfig(TMR_Type* TMRx, uint16_t TMR_OCPreload);
void TMR_OC1FastConfig(TMR_Type* TMRx, uint16_t TMR_OCFast);
void TMR_OC2FastConfig(TMR_Type* TMRx, uint16_t TMR_OCFast);
void TMR_OC3FastConfig(TMR_Type* TMRx, uint16_t TMR_OCFast);
void TMR_OC4FastConfig(TMR_Type* TMRx, uint16_t TMR_OCFast);
void TMR_ClearOC1Ref(TMR_Type* TMRx, uint16_t TMR_OCClear);
void TMR_ClearOC2Ref(TMR_Type* TMRx, uint16_t TMR_OCClear);
void TMR_ClearOC3Ref(TMR_Type* TMRx, uint16_t TMR_OCClear);
void TMR_ClearOC4Ref(TMR_Type* TMRx, uint16_t TMR_OCClear);
void TMR_OC1PolarityConfig(TMR_Type* TMRx, uint16_t TMR_OCPolarity);
void TMR_OC1NPolarityConfig(TMR_Type* TMRx, uint16_t TMR_OCNPolarity);
void TMR_OC2PolarityConfig(TMR_Type* TMRx, uint16_t TMR_OCPolarity);
void TMR_OC2NPolarityConfig(TMR_Type* TMRx, uint16_t TMR_OCNPolarity);
void TMR_OC3PolarityConfig(TMR_Type* TMRx, uint16_t TMR_OCPolarity);
void TMR_OC3NPolarityConfig(TMR_Type* TMRx, uint16_t TMR_OCNPolarity);
void TMR_OC4PolarityConfig(TMR_Type* TMRx, uint16_t TMR_OCPolarity);
void TMR_CCxCmd(TMR_Type* TMRx, uint16_t TMR_Channel, uint16_t TMR_CCx);
void TMR_CCxNCmd(TMR_Type* TMRx, uint16_t TMR_Channel, uint16_t TMR_CCxN);
void TMR_SelectOCxM(TMR_Type* TMRx, uint16_t TMR_Channel, uint16_t TMR_OCMode);
void TMR_UpdateDisableConfig(TMR_Type* TMRx, FunctionalState NewState);
void TMR_UpdateRequestConfig(TMR_Type* TMRx, uint16_t TMR_UpdateSource);
void TMR_SelectHallSensor(TMR_Type* TMRx, FunctionalState NewState);
void TMR_SelectOnePulseMode(TMR_Type* TMRx, uint16_t TMR_OPMode);
void TMR_SelectPlusMode(TMR_Type* TIMx, uint16_t  TIMX_PLUS_MODE_STATE);
void TMR_SelectOutputTrigger(TMR_Type* TMRx, uint16_t TMR_TRGOSource);
void TMR_SelectSlaveMode(TMR_Type* TMRx, uint16_t TMR_SlaveMode);
void TMR_SelectMasterSlaveMode(TMR_Type* TMRx, uint16_t TMR_MasterSlaveMode);
void TMR_SetCounter(TMR_Type* TMRx, uint32_t Counter);
void TMR_SetAutoreload(TMR_Type* TMRx, uint32_t Autoreload);
void TMR_SetCompare1(TMR_Type* TMRx, uint32_t Compare1);
void TMR_SetCompare2(TMR_Type* TMRx, uint32_t Compare2);
void TMR_SetCompare3(TMR_Type* TMRx, uint32_t Compare3);
void TMR_SetCompare4(TMR_Type* TMRx, uint32_t Compare4);
void TMR_SetIC1DIV(TMR_Type* TMRx, uint16_t TMR_ICPSC);
void TMR_SetIC2DIV(TMR_Type* TMRx, uint16_t TMR_ICPSC);
void TMR_SetIC3DIV(TMR_Type* TMRx, uint16_t TMR_ICPSC);
void TMR_SetIC4DIV(TMR_Type* TMRx, uint16_t TMR_ICPSC);
void TMR_SetClockDivision(TMR_Type* TMRx, uint16_t TMR_CKD);
uint32_t TMR_GetCapture1(TMR_Type* TMRx);
uint32_t TMR_GetCapture2(TMR_Type* TMRx);
uint32_t TMR_GetCapture3(TMR_Type* TMRx);
uint32_t TMR_GetCapture4(TMR_Type* TMRx);
uint32_t TMR_GetCounter(TMR_Type* TMRx);
uint16_t TMR_GetDIV(TMR_Type* TMRx);
FlagStatus TMR_GetFlagStatus(TMR_Type* TMRx, uint16_t TMR_FLAG);
void TMR_ClearFlag(TMR_Type* TMRx, uint16_t TMR_FLAG);
ITStatus TMR_GetINTStatus(TMR_Type* TMRx, uint16_t TMR_INT);
void TMR_ClearITPendingBit(TMR_Type* TMRx, uint16_t TMR_INT);

#ifdef __cplusplus
}
#endif

#endif /*__AT32F4xx_TIM_H */
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */


